Workspace/test_cases/vertificating/sod_shock_tube/0_org/Uz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Uz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftSide
    {
        type            calculated;
        value           uniform 0;
    }
    rightSide
    {
        type            calculated;
        value           uniform 0;
    }
    emptywalls
    {
        type            empty;
    }
}


// ************************************************************************* //
